Importing libraries and dataset

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('income.csv')

Exploring the dataset

In [3]:
df.shape

(31978, 13)

In [4]:
df.head()

,age,JobType,EdType,maritalstatus,occupation,relationship,race,gender,capitalgain,capitalloss,hoursperweek,nativecountry,SalStat
0,45,Private,HS-grad,Divorced,Adm-clerical,Not-in-family,White,Female,0,0,28,United-States,"less than or equal to 50,000"
1,24,Federal-gov,HS-grad,Never-married,Armed-Forces,Own-child,White,Male,0,0,40,United-States,"less than or equal to 50,000"
2,44,Private,Some-college,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,"greater than 50,000"
3,27,Private,9th,Never-married,Craft-repair,Other-relative,White,Male,0,0,40,Mexico,"less than or equal to 50,000"
4,20,Private,Some-college,Never-married,Sales,Not-in-family,White,Male,0,0,35,United-States,"less than or equal to 50,000"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31978 entries, 0 to 31977
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            31978 non-null  int64
 1   JobType        31978 non-null  object
 2   EdType         31978 non-null  object
 3   maritalstatus  31978 non-null  object
 4   occupation     31978 non-null  object
 5   relationship   31978 non-null  object
 6   race           31978 non-null  object
 7   gender         31978 non-null  object
 8   capitalgain    31978 non-null  int64
 9   capitalloss    31978 non-null  int64
 10  hoursperweek   31978 non-null  int64
 11  nativecountry  31978 non-null  object
 12  SalStat        31978 non-null  object
dtypes: int64(4), object(9)
memory usage: 3.2+ MB

In [6]:
df.describe()

                age   capitalgain   capitalloss  hoursperweek
count  31978.000000  31978.000000  31978.000000  31978.000000
mean      38.579023   1064.360623     86.739352     40.417850
std       13.662085   7298.596271    401.594301     12.345285
min       17.000000      0.000000      0.000000      1.000000
25%       28.000000      0.000000      0.000000     40.000000
50%       37.000000      0.000000      0.000000     40.000000
75%       48.000000      0.000000      0.000000     45.000000
max       90.000000  99999.000000   4356.000000     99.000000

Converting categorical data into numerical data

In [8]:
gender_num=pd.get_dummies(df['gender'],drop_first=True)

Selecting features for X and Y

In [9]:
X=df.iloc[:,[0,10]]

In [10]:
X

       age  hoursperweek
0       45            28
1       24            40
2       44            40
3       27            40
4       20            35
...    ...           ...
31973   34            60
31974   34            40
31975   23            40
31976   42            40
31977   29            40

[31978 rows x 2 columns]

In [11]:
pd.concat([X, gender_num], axis=1, ignore_index=True)

        0   1  2
0      45  28  0
1      24  40  1
2      44  40  1
3      27  40  1
4      20  35  1
...    ..  .. ..
31973  34  60  1
31974  34  40  0
31975  23  40  1
31976  42  40  0
31977  29  40  1

[31978 rows x 3 columns]

In [13]:
Y=pd.get_dummies(df['SalStat'],drop_first=True)

Splitting data into train and test set

In [14]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test=train_test_split(X,Y,test_size=0.25)

Fitting Simple Linear Regression Model to train set

In [15]:
from sklearn.linear_model import LinearRegression
regressor=LinearRegression()
regressor.fit(X_train,Y_train)

LinearRegression()

Prediction of Y

In [16]:
Y_pred=regressor.predict(X_test)

Finding r2 score

In [17]:
from sklearn.metrics import r2_score
score=r2_score(Y_test, Y_pred)
print(score)

0.09975881624178518